<?php
$countries = [
    ["Город" => "Токио", "Страна" => "Япония", "Континент" => "Азия"],
    ["Город" => "Мехико", "Страна" => "Мексика", "Континент" => "Северная Америка"],
    ["Город" => "Нью-Йорк", "Страна" => "США", "Континент" => "Северная Америка"],
    ["Город" => "Мумбаи", "Страна" => "Индия", "Континент" => "Азия"],
    ["Город" => "Сеул", "Страна" => "Корея", "Континент" => "Азия"],
    ["Город" => "Шанхай", "Страна" => "Китай", "Континент" => "Азия"],
    ["Город" => "Лагос", "Страна" => "Нигерия", "Континент" => "Африка"],
    ["Город" => "Буэнос-Айрес", "Страна" => "Аргентина", "Континент" => "Южная Америка"],
    ["Город" => "Каир", "Страна" => "Египет", "Континент" => "Африка"],
    ["Город" => "Лондон", "Страна" => "Великобритания", "Континент" => "Европа"]
];
?>

<!DOCTYPE html>
<html>
<head>
 <title>Массив в HTML таблице</title>
 <style type="text/css">
  td, th {width: 8em; border: 1px solid black; padding-left: 4px;}
  th {text-align:center;}
  table {border-collapse: collapse; border: 1px solid black;}
 </style>
</head>
<body>
 <table>
  <?php
  echo "<tr>";
  foreach($countries[0] as $key => $value) {
    echo "<td>$key</td>";
  }
  echo "</tr>";

  foreach ($countries as $row) {
   echo "<tr>";
   foreach ($row as $cell) {
    echo "<td>$cell</td>";
   }
   echo "</tr>";
  }
  ?>
 </table>
</body>
</html>